{
  "common": {
    "navigation": {
      "title": "Navigation",
      "description": "Explorez mon portfolio",
      "about": "à propos",
      "aboutDesc": "En savoir plus sur mon parcours",
      "projects": "projets",
      "projectsDesc": "Découvrir mes réalisations"
    },
    "footer": "Fait avec le 💜 par moi-même",
    "languages": {
      "title": "Langue",
      "changeLanguage": "Changer la langue",
      "active": "Actif"
    },
    "unsplash": {
      "noPhotographer": "Photo aléatoire provenant d'Unsplash",
      "photoBy": "Photo aléatoire prise par",
      "from": "depuis"
    }
  },
  "components": {
    "contact": {
      "title": "Travaillons ensemble",
      "description": "Prêt à transformer vos idées en réalité ?",
      "emailButton": "Envoyer un email",
      "socials": "Mes réseaux"
    },
    "projectCard": {
      "live": "Démo live",
      "moreDetails": "✨ Cliquez pour plus de détails ✨",
      "viewAll": "Voir tous les projets",
      "viewAllCard": {
        "title": "Allez voir tous les projets!",
        "description": "N'hésitez pas à cliquer sur cette carte pour voir tous les projets."
      }
    }
  },
  "pages": {
    "home": {
      "title": "Hello, moi c'est",
      "name": "Dylan",
      "subtitle": "Je suis développeur intégrateur web, diplômé d'OpenClassrooms en 2024.",
      "bio": {
        "title": "Qui suis-je",
        "paragraph1": "À 25 ans, j'ai transformé ma passion pour les jeux vidéo et l'informatique en métier grâce à une formation sur OpenClassrooms qui m'a permis de décrocher ma certification de développeur intégrateur web (niveau 5) en 2024. Un rêve de gamin devenu réalité après des heures (beaucoup d'heures !) d'apprentissage et de pratique.",
        "paragraph2": "Je suis ce genre de développeur qui passe des soirées entières à peaufiner les détails - c'est plus fort que moi ! Cette attention particulière fait que mon code reste lisible et bien structuré. Ce qui me fait vraiment vibrer ? Voir un projet prendre vie, résoudre des problèmes complexes et apprendre constamment.",
        "paragraph3": "Chaque bug résolu est une petite victoire personnelle qui me pousse à me dépasser et à explorer de nouvelles possibilités."
      },
      "skills": {
        "title": "Compétences",
        "frontend": "Frontend",
        "backend": "APIs & Données",
        "design": "Design"
      },
      "passions": {
        "title": "Mes passions",
        "gaming": {
          "title": "Passionné de jeux",
          "description": "Passionné par les jeux de stratégie, j'aime relever des défis complexes et trouver des solutions optimales. Cette approche analytique et méthodique guide mon travail de développement, où chaque projet est abordé avec réflexion et précision."
        },
        "learning": {
          "title": "Apprentissage continu",
          "description": "Je cherche constamment à m'améliorer et à apprendre de nouvelles technologies pour rester à la pointe. La veille technologique fait partie intégrante de mon quotidien."
        },
        "music": {
          "title": "Musique",
          "description": "La musique m'aide à me concentrer pendant de longues sessions de codage. Elle stimule ma créativité et améliore ma productivité quand je développe."
        }
      },

      "cleanCode": {
        "title": "Code performant",
        "description": "Du code propre, optimisé et facile à maintenir sur le long terme.",
        "li1": "Tests unitaires et d'intégration",
        "li2": "Architecture claire et maintenable",
        "li3": "Code documenté et versionné"
      },
      "projects": {
        "title": "Mes projets",
        "description": "Des sites web modernes combinant Next.js, React et TailwindCSS pour des expériences utilisateurs optimales.",
        "viewAll": "Voir les projets"
      },
      "certif": {
        "degree": "Dévéloppeur intégrateur web",
        "institution": "OpenClassrooms",
        "years": "2024",

        "description": "Cette certification professionnelle niveau 5 atteste de ma capacité à concevoir, développer et déployer des solutions informatiques complètes, depuis l'analyse des besoins jusqu'à la mise en production.\n\nCouvrant l'ensemble du cycle de développement web, elle valide mes compétences techniques (front-end/back-end, API, tests), ma maîtrise des méthodologies de projet et ma capacité à optimiser les performances des applications pour répondre aux exigences utilisateurs."
      },
      "approach": {
        "title": "Ma philosophie",
        "description": "Un équilibre entre excellence technique et compréhension des besoins utilisateurs.",
        "pointTitle1": "Code élégant",
        "point1": "Code clair et structuré pour faciliter maintenance et collaboration.",
        "pointTitle2": "Performance",
        "point2": "Optimisation des ressources pour des applications rapides.",
        "pointTitle3": "Évolutivité",
        "point3": "Architecture modulaire qui s'adapte aux besoins et technologies.",
        "pointTitle4": "Expérience utilisateur",
        "point4": "Interfaces intuitives centrées sur les besoins réels."
      }
    },
    "projects": {
      "title": "Mes projets",
      "subtitle": "Découvrez les projets sur lesquels j'ai travaillé, du développement frontend aux applications fullstack.",
      "liveButton": "Voir en ligne",
      "categories": {
        "all": "Tous",
        "frontend": "Frontend",
        "fullstack": "Fullstack",
        "mobile": "Mobile",
        "other": "Autres"
      },
      "noProjects": {
        "title": "Aucun projet trouvé",
        "message": "Aucun projet ne correspond à ce filtre. Essayez une autre catégorie."
      }
    }
  }
}
